OdDbBaseLayoutPE.scaleLineweights(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines if the lineweights should be scaled according to layout scale factor
\param [in] A pointer to a layout object.
\returns Returns true if the lineweights should be scaled, otherwise returns false.

OdDbBaseLayoutPE.getStdScaleType(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdDbBaseLayoutPE.StdScaleType*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the standard scale type for this PlotSettings object (DXF 75).
\remarks
stdScaleType() returns one of the of the following
Name            Value   Scale
kScaleToFit     0       Scaled to Fit
k1_128in_1ft    1       1/128=1'
k1_64in_1ft     2       1/64=1'
k1_32in_1ft     3       1/32=1'
k1_16in_1ft     4       1/16=1'
k3_32in_1ft     5       3/32=1'
k1_8in_1ft      6       1/8=1'
k3_16in_1ft     7       3/16=1'
k1_4in_1ft      8       1/4=1'
k3_8in_1ft      9       3/8=1'
k1_2in_1ft      10      1/2=1'
k3_4in_1ft      11      3/4=1'
k1in_1ft        12      1=1'
k3in_1ft        13      3=1'
k6in_1ft        14      6=1'
k1ft_1ft        15      1'=1'
k1_1            16      1:1
k1_2            17      1:2
k1_4            18      1:4
k1_5            19      1:5
k1_8            20      1:8
k1_10           21      1:10
k1_16           22      1:16
k1_20           23      1:20
k1_30           24      1:30
k1_40           25      1:40
k1_50           26      1:50
k1_100          27      1:100
k2_1            28      2:1
k4_1            29      4:1
k8_1            30      8:1
k10_1           31      10:1
k100_1          32      100:1
k1000_1         33      1000:1
k1and1_2in_1ft  34      1.5"=1'

OdDbBaseLayoutPE.getApproxExtents(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the approximate extents of a specified layout.
\param        [in] A pointer to a layout object.
\param extMin [in] A reference to an OdGePoint3d object to store and return the left lower corner of the extents rectangle.
\param extMax [in] A reference to an OdGePoint3d object to store and return the right upper corner of the extents rectangle.

OdDbBaseLayoutPE.scalePSLinetypes(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether generation of linetypes for polylines is used in paper space for the specified layout.
\param [in]  A pointer to a layout object.

OdDbBaseLayoutPE.getBlockId(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the block identifier for a specified layout.
\param [in]  A pointer to a layout object.

OdDbBaseLayoutPE.plotPaperUnits(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current plot units for a specified layout in paper space.
\param [in]  A pointer to a layout object.

OdDbBaseLayoutPE.getPlotPaperSize(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the current paper size for a specified layout.
\param   [in]  A pointer to a layout object.
\param x [out] A reference to be used for returning the paper width value.
\param y [out] A reference to be used for returning the paper height value.

OdDbBaseLayoutPE.getPlotOrigin(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the current origin plot for a specified layout.
\param   [in]  A pointer to a layout object.
\param x [out] A reference to be used for returning the X coordinate of the layout's plot origin.
\param y [out] A reference to be used for returning the Y coordinate of the layout's plot origin.

OdDbBaseLayoutPE.getPlotWindowArea(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the current information about the plot window area for a specified layout.
\param      [in]  A pointer to a layout object.
\param xmin [out] A reference to be used for returning the X coordinate of the window area's lower left corner.
\param ymin [out] A reference to be used for returning the Y coordinate of the window area's lower left corner.
\param xmax [out] A reference to be used for returning the X coordinate of the window area's upper right corner.
\param ymax [out] A reference to be used for returning the Y coordinate of the window area's upper right corner.

OdDbBaseLayoutPE.getPlotViewName(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns a plot viewport name for a specified layout.
\param A pointer to a layout object.

OdDbBaseLayoutPE.plotType(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current plot type for a specified layout.
\param [in]  A pointer to a layout object.

OdDbBaseLayoutPE.getCustomPrintScale(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a custom print scale value for a specified layout.
\param [in]  A pointer to a layout object.
\param numerator    [out] A reference to a double value to store and return the real world units.
\param denominator  [out] A reference to a double value to store and return the drawing units.

OdDbBaseLayoutPE.getStdScale(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the standard scale value for a specified layout.
\param        [in]  A pointer to a layout object.
\param scale  [out] A reference to a double value to store and return the scale value.

OdDbBaseLayoutPE.useStandardScale(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a standard scale is used for a specified layout.
\param [in] A pointer to a layout object.
\returns Returns true if a standard scale is used for the layout, otherwise returns false.

OdDbBaseLayoutPE.getGeomExtents(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdGeExtents3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns current geometry extents of a specified layout object.
\param     [in]   A pointer to a layout object.
\param ext [out]  A reference to an OdGeExtents3d object to store and retrieve the layout's geometry extents.

OdDbBaseLayoutPE.isOverallVPortErased(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether the overall viewport of a layout is erased.
\param [in] A pointer to a layout object.
\returns Returns true if the overall viewport of the layout is erased, otherwise returns false.

OdDbBaseLayoutPE.getLeftMargin(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current left margin value for a specified layout.
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.getBottomMargin(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current bottom margin value for a specified layout.
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.getRightMargin(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current right margin value for a specified layout.
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.getTopMargin(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current top margin value for a specified layout.
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.plotRotation(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current plot rotation mode for a specified layout.
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.getPaperSize(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the current paper size for a specified layout.
\param             [in]  A pointer to a layout object.
\param paperWidth  [out] A reference for storing and retrieving paper width value.
\param paperHeight [out] A reference for storing and retrieving paper height value.

OdDbBaseLayoutPE.paperName(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the name of the paper orientation for a specified layout (for example, "A4").
\param [in] A pointer to a layout object.

OdDbBaseLayoutPE.showPlotStyles(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether plot styles should be shown for a specified layout.
\param [in] A pointer to a layout object.
\returns Returns true if plot styles should be shown, otherwise returns false.

OdDbBaseLayoutPE.printLineweights(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether lineweights should be printed for a specified layout.
\param [in] A pointer to a layout object.
\returns Returns true if lineweights should be printed, otherwise returns false.

OdDbBaseLayoutPE.isModelLayout(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified layout belongs to model space.
\param [in] A pointer to a layout object.
\returns Returns true if the layout belongs to model space, otherwise returns false.

OdDbBaseLayoutPE.name(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the current name of a specified layout.
\param [in] A pointer to a layout object.